var = 64
csv_file = "../lab_3/64.csv"
json_file = "../lab_3/result.json"

regulars = {
    "telephone": "^\\+7-\\(9\\d{2}\\)-\\d{3}-\\d{2}-\\d{2}$",
    "height": "^[1-2]\\.\\d{2}$",
    "inn": "^\\d{12}$",
    "identifier": "^\\d{2}-\\d{2}/\\d{2}$",
    "occupation": "^[а-яА-ЯёЁa-zA-Z\\s-]+$",
    "latitude": "^[+-]?(90(\\.0+)?|([0-8]?\\d(\\.\\d+)?))$",
    "blood_type": "^(?:AB|A|B|O)[+\\u2212]$",
    "issn": "^\\d{4}-\\d{4}$",
    "uuid": "^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$",
    "date": "^\\d{4}-(?:0[1-9]|1[0-2])-(?:0[1-9]|1\\d|2[0-9]|3[0-1])$"
}
